samuelpoiraud/robot/STM32/QS/QS_ax12.c
	#define MIN_INSTRUCTION_PACKET_SIZE 6
	#define MAX_STATUS_PACKET_SIZE 8

	//Macro pour simplifier l'incrementation d'index (la fonction modulo fait une division assez lourde, donc profitons de super-macro
	//le modulo (%) c'est bien, mais c'est aussi beaucoup d'opération pour les cas utilisés (les valeurs ne doivent jamais dépasser 2*div)
	#define INC_WITH_MOD(val,div) (( (val)+1 < div )? (val)+1 : 0)

	/***********************************************************************/

typedef struct{
	volatile AX12_status_t last_status;
	Uint16 angle_limit[2];	//sauvegarde des angles limites lors d'un passage en mode wheel (rotation complète en continue) Si l'AX12/RX24 était déja dans ce mode, les angles limites défini à 0°-300°.
	bool_e is_wheel_enabled;
	// Possibilité d'ajout de membres ...
} AX12_servo_t;

//Paquet instruction a envoyer a l'AX12
typedef struct{
	Uint8 id_servo;
	Uint8 type;
	Uint8 address;
	union {
		Uint16 param;
		struct {
			Uint8 param_1;	//poids fort
			Uint8 param_2;	//poids faible
		};
	};
	Uint8 size;
} AX12_instruction_packet_t;


//Paquet renvoyé par l'AX12, 2 paramètres 8bits maximum
typedef struct{
	Uint8 id_servo;
	Uint16 error;  // l'AX12/RX24 n'utilise que 8 bits
	union {
		Uint16 param;
		struct {
			Uint8 param_1;	//poids fort
			Uint8 param_2;	//poids faible
		};
	};
	Uint8 size;
} AX12_status_packet_t;

typedef struct{
	AX12_instruction_packet_t buffer[AX12_INSTRUCTION_REAL_NEEDED_BUFFER_SIZE];
	Uint8 start_index;
	Uint8 end_index;
} AX12_instruction_buffer;


//Machine à états

// Raison d'appel de la fonction de la machine à états
typedef enum {
	AX12_SME_NoEvent,
	AX12_SME_RxInterrupt,
	AX12_SME_TxInterruptAX12,
	AX12_SME_Timeout
} AX12_state_machine_event_e;

// Etat de la machine à états
typedef enum {
	AX12_SMS_ReadyToSend = 0,
	AX12_SMS_Sending,
	AX12_SMS_WaitingAnswer
} AX12_state_machine_state_e;


typedef struct {
	volatile AX12_state_machine_state_e state;
	volatile Uint16 timeout_counter;	//compteur décrémenté par le timer lorsque que l'état est AX12_SMS_WaitingAnswer

	AX12_instruction_packet_t current_instruction;

	Uint8 receive_index;

	//Utilisé en mode SEND
#ifdef AX12_UART_Ptr
	Uint8 ax12_sending_index;
#endif
} AX12_state_machine_t;

/*************************************************************************************/

// Variables globales, toutes les variables sont intialisée a zero, il n'y a pas de {0} ou autre pour eviter les warnings (avec -Wall) et c'est plus simple et pratique de rien mettre que des {{{0}},{0,0},0} et pour eviter d'avoir des warnings car les warnings c'est mal (défini dans l'ainsi C)

static AX12_servo_t AX12_on_the_robot[AX12_NUMBER];	//Tableau de structure contenant les informations liées à chaque AX12
static AX12_state_machine_t state_machine = {0};	//Machine à états du driver

//Queue contenant les instructions demandée (ce buffer est géré pas les fonctions/macro AX12_instruction_*, il n'y a qu'un buffer pour tous les AX12)
static volatile AX12_instruction_buffer AX12_special_instruction_buffer;
//Cette variable est à TRUE si le driver est en mode préparation de commandes. Voir doc de AX12_start_command_block dans le .h
static bool_e AX12_prepare_commands = FALSE;

/**************************************************************************/
/** Fonctions internes au driver de l'AX12+ et macros                    **/
/**************************************************************************/

static inline Uint16 AX12_decode_value_range(Uint8 mem_addr, bool_e get_max);	//get_max = 1 pour récupérer la valeur max pour une adresse donnée, get_max = 0 pour récupérer le minimum
static Uint8 AX12_instruction_packet_calc_checksum(AX12_instruction_packet_t* instruction_packet);
static Uint8 AX12_get_instruction_packet(Uint8 byte_offset, AX12_instruction_packet_t* instruction_packet);				//Renvoi l'octet d'une instruction a envoyer
#ifdef AX12_STATUS_RETURN_CHECK_CHECKSUM
static Uint8 AX12_status_packet_calc_checksum(AX12_status_packet_t* status_packet);
#endif
static bool_e AX12_update_status_packet(Uint8 receive_byte, Uint8 byte_offset, AX12_status_packet_t* status_packet);	//retourne FALSE si le paquet est non valide, sinon TRUE
static void AX12_state_machine(AX12_state_machine_event_e event);
static void AX12_UART_init_all(Uint32 uart_speed);
static void AX12_UART_init(USART_TypeDef* uartPtr, Uint16 baudrate);
static void AX12_UART_DisableIRQ();
static void AX12_UART_EnableIRQ();
static void AX12_UART_putc(Uint8 c);
static Uint8 AX12_UART_getc();
static bool_e AX12_UART_GetFlagStatus(Uint16 flag);
static void AX12_UART_ITConfig(Uint16 flag, FunctionalState enable);

/**************************************************************************/
/** Fonctions/macro gérant les instructions et le buffer d'instruction   **/
/**************************************************************************/

/*
 * Les fonctions AX12_instruction_async_* sont asynchrones, utiliser AX12_instruction_wait pour attendre la fin de leurs exécutions avant AX12_instruction_get_last_status
 * Attention, ces fonctions attente que de la place se libère dans le buffer interne, attention lors de l'utilisation des fonctions de l'AX12 dans des interruptions
 * Pour prévenir le problème, vous pouvez utiliser AX12_instruction_buffer_is_full() ou changer la priorité de votre interruption
 * L'interruption de l'UART de l'AX12 a pour priorité 5 (pour Tx et Rx) (Si aucun changement n'est fait, l'IT d'un timer a une priorité de 4 comme la majeure partie des ITs)
 */

//Vous ne pouvez pas utiliser la fonction "AX12_instruction_*read" si le mode de retour d'information est AX12_STATUS_RETURN_NEVER

#if AX12_STATUS_RETURN_MODE != AX12_STATUS_RETURN_NEVER
	static bool_e AX12_instruction_async_read(Uint8 id_servo, Uint8 address, Uint8 length);
	static Uint16 AX12_instruction_read16(Uint8 id_servo, Uint8 address, bool_e *isOk);
	static Uint8  AX12_instruction_read8(Uint8 id_servo, Uint8 address, bool_e *isOk);
#endif

static bool_e AX12_instruction_write8(Uint8 id_servo, Uint8 address, Uint8 value);
static bool_e AX12_instruction_write16(Uint8 id_servo, Uint8 address, Uint16 value);
static bool_e AX12_instruction_async_write8(Uint8 id_servo, Uint8 address, Uint8 value);
static bool_e AX12_instruction_async_write16(Uint8 id_servo, Uint8 address, Uint16 value);
static bool_e AX12_instruction_async_ping(Uint8 id_servo);
static bool_e AX12_instruction_async_prepare_write8(Uint8 id_servo, Uint8 address, Uint8 value);
static bool_e AX12_instruction_async_prepare_write16(Uint8 id_servo, Uint8 address, Uint16 value);
static bool_e AX12_instruction_async_execute_write();
static bool_e AX12_instruction_ping(Uint8 id_servo);
static bool_e AX12_instruction_wait(Uint8 id_servo);
static bool_e AX12_instruction_buffer_is_full();
static void AX12_instruction_next(Uint16 error, Uint16 param);
static AX12_status_t AX12_instruction_get_last_status(Uint8 id_servo);
static void AX12_instruction_reset_last_status(Uint8 id_servo);

