samuelpoiraud/robot/STM32/QS/QS_ax12.c
	return ~checksum;
}
#endif

static bool_e AX12_update_status_packet(Uint8 receive_byte, Uint8 byte_offset, AX12_status_packet_t* status_packet)
{
	//Si c'est le dernier octet, verifier le checksum si AX12_STATUS_RETURN_CHECK_CHECKSUM est defini
	if(byte_offset > 3 && byte_offset == status_packet->size - 1) {
	#ifdef AX12_STATUS_RETURN_CHECK_CHECKSUM
		if(receive_byte != AX12_status_packet_calc_checksum(status_packet)) {
			debug_printf("AX12[%d]: invalid checksum\n", status_packet->id_servo);
			return FALSE;
		} else return TRUE;
	#else
		return TRUE;
	#endif
	}

	//mise a jour de la structure instruction avec les octets reçus
	switch(byte_offset)
	{
		case 0:
			//Initialisation de a structure a des valeurs par défaut
			status_packet->id_servo = 0;
			status_packet->size = 0;
			//status_packet->error = AX12_ERROR_OK; contient IN_PROGRESS déjà
			status_packet->param = 0;

			if(receive_byte != 0xFF)
				return FALSE;
			break;

		case 1:
			if(receive_byte != 0xFF)
				return FALSE;
			break;

		case 2:
			status_packet->id_servo = receive_byte;
			break;

		case 3:
			status_packet->size = receive_byte + 4;
			break;

		case 4:
			//pour être sur de ne pas avoir le bit 7 a 1, si l'AX12/RX24 le met a 1, on met tous les bits a 1
			status_packet->error = receive_byte & 0x7F; //On enlève le IN_PROGRESS en passant
			break;

		case 5:
			status_packet->param_1 = receive_byte;
			break;

		case 6:
			status_packet->param_2 = receive_byte;
			break;

		default:
			if(byte_offset > 6)
				debug_printf("AX12: Error: AX12_update_status_packet(): trop d'octet reçu > 6\n");
	}

	return TRUE;
}

//La machine a états est appelée par les interruptions de l'UART et par le timer
static void AX12_state_machine(AX12_state_machine_event_e event) {
	static volatile int processing_state = 0;

	#if defined(VERBOSE_MODE) && defined(AX12_DEBUG_PACKETS)
		//Pour le deboggage (avec debug_printf à la fin de l'envoi/reception d'un paquet)
		static Uint8 AX12_UART2_reception_buffer[MAX_STATUS_PACKET_SIZE*2] = {0};
		Uint8 i, pos;
	#endif

//sécurisation des appels à cette fonction lorsque event == AX12_SME_NoEvent pour eviter que l'état AX12_SMS_ReadyToSend soit exécuté plusieurs fois
//si une IT arrive a un certain moment, elle sera executée complètement, donc processing_state reviendra à son état d'origine
	if(event == AX12_SME_NoEvent) {
//1) Si une IT arrive a ce moment, elle s'execute entièrement et change l'état de AX12_SMS_ReadyToSend en AX12_SMS_Sending, cet appel continuera et le switch branchera sur AX12_SMS_Sending, il n'y a rien de prévu pour AX12_SME_NoEvent donc cet appel ne fera rien au final
		if(processing_state > 0)
//2) Si une IT arrive a ce moment, elle s'executera pas, elle retournera sans rien faire car processing_state est > 0
			return;
//3) Si une IT arrive a ce moment, elle s'executera entièrement car processing_state == 0, l'état passera de AX12_SMS_ReadyToSend à AX12_SMS_Sending et cet appel de fonction ne fera rien comme au 1)
		processing_state = 1;
//4) Si une IT arrive a ce moment, elle ne s'executera pas car processing_state > 0
	} else if(event == AX12_SME_Timeout) {
		AX12_UART_DisableIRQ();
	} else if(event == AX12_SME_RxInterrupt || event == AX12_SME_TxInterruptAX12) {
		TIMER_SRC_TIMER_DisableIT();
	}

//Si une IT arrive avec event == AX12_SME_TxInterrupt, elle n'aura un effet que dans l'état AX12_SMS_Sending (et cette interruption ne devrait être lancée que après le putcUART2 dans AX12_SMS_ReadyToSend et pas dans AX12_SMS_Sending car une interruption n'est pas prioritaire sur elle-même)
//Si une IT arrive avec event == AX12_SME_RxInterrupt, elle n'aura un effet que dans l'état AX12_SMS_WaitingAnswer. Elle ne peut être lancée que si le timer n'a pas eu d'interruption et désactive l'interruption du timer

	switch(state_machine.state)
	{
		case AX12_SMS_ReadyToSend:
			if(event == AX12_SME_NoEvent)
			{
				// Choix du paquet à envoyer et début d'envoi
				if(!AX12_instruction_queue_is_empty())
					state_machine.current_instruction = AX12_instruction_queue_get_current();
				else {	//s'il n'y a rien a faire, mettre en veille la machine a état, l'UART sera donc inactif (et mettre en mode reception pour ne pas forcer la sortie dont on défini la tension, celle non relié a l'AX12)
					while(!AX12_UART_GetFlagStatus(USART_FLAG_TC));   //inifinite loop si uart pas initialisé
					GPIO_WriteBit(AX12_DIRECTION_PORT_AX12, RX_DIRECTION);
					break;
				}

				state_machine.state = AX12_SMS_Sending;
				AX12_on_the_robot[state_machine.current_instruction.id_servo].last_status.error = AX12_ERROR_IN_PROGRESS;
#ifdef AX12_UART_Ptr
				state_machine.ax12_sending_index = 0;
#endif

				state_machine.receive_index = 0;


				#if defined(VERBOSE_MODE) && defined(AX12_DEBUG_PACKETS)
					debug_printf("AX12 Tx:");
					for(i = 0; i<state_machine.current_instruction.size; i++)
						debug_printf(" %02x", AX12_get_instruction_packet(i, &state_machine.current_instruction));
					debug_printf("\n");
				#endif

				GPIO_WriteBit(AX12_DIRECTION_PORT_AX12, TX_DIRECTION);


				TIMER_SRC_TIMER_start_ms(AX12_STATUS_SEND_TIMEOUT);	//Pour le timeout d'envoi, ne devrait pas arriver

#ifdef AX12_UART_Ptr
				state_machine.ax12_sending_index++;	//Attention! Nous devons incrementer sending_index AVANT car il y a un risque que l'interuption Tx arrive avant l'incrementation lorsque cette fonction est appellée par AX12_init() (qui n'est pas dans une interruption)
#endif


				AX12_UART_putc(AX12_get_instruction_packet(0, &state_machine.current_instruction));
				AX12_UART_ITConfig(USART_IT_TXE, ENABLE);
			} /*else if(event == AX12_SME_TxInterrupt) {
				AX12_UART_ITConfig(USART_IT_TXE, DISABLE);
			}*/
		break;

		case AX12_SMS_Sending:
			if(event == AX12_SME_TxInterruptAX12)
			{
				if(event == AX12_SME_TxInterruptAX12) {
#ifdef AX12_UART_Ptr
					// ax12
					if(state_machine.ax12_sending_index < state_machine.current_instruction.size) {
						USART_SendData(AX12_UART_Ptr, AX12_get_instruction_packet(state_machine.ax12_sending_index, &state_machine.current_instruction));
						state_machine.ax12_sending_index++;
					} else
						USART_ITConfig(AX12_UART_Ptr, USART_IT_TXE, DISABLE);
#endif
				}
//				if(state_machine.sending_index < state_machine.current_instruction.size) {
//					AX12_UART_putc(AX12_get_instruction_packet(state_machine.sending_index, &state_machine.current_instruction));
//					state_machine.sending_index++;
//				}


				if(
		#ifdef AX12_UART_Ptr
						state_machine.ax12_sending_index >= state_machine.current_instruction.size
		#endif
					)
				{
					TIMER_SRC_TIMER_stop();
					TIMER_SRC_TIMER_resetFlag();

					if(AX12_instruction_has_status_packet(state_machine.current_instruction))
					{
						#if defined(VERBOSE_MODE) && defined(AX12_DEBUG_PACKETS)
							for(i=0; i<MAX_STATUS_PACKET_SIZE*2; i++)
								AX12_UART2_reception_buffer[i] = 0;
							pos = 0;
						#endif

