samuelpoiraud/robot/STM32/QS/QS_ax12.c
	CcwComplianceSlope = A;
	CcwComplianceMargin = B;
	CwComplianceMargin = C;
	CwComplianceSlope = D;

	if(!AX12_instruction_async_write8(id_servo, AX12_CCW_COMPLIANCE_SLOPE, CcwComplianceSlope))   // A verifier value 16bits envoie dans une fonction 8 bits
		return FALSE;
	if(!AX12_instruction_async_write8(id_servo, AX12_CCW_COMPLIANCE_MARGIN, CcwComplianceMargin))
		return FALSE;
	if(!AX12_instruction_async_write8(id_servo, AX12_CW_COMPLIANCE_MARGIN, CwComplianceMargin))
		return FALSE;
	if(!AX12_instruction_async_write8(id_servo, AX12_CW_COMPLIANCE_SLOPE, CwComplianceSlope))
		return FALSE;

	#if AX12_STATUS_RETURN_MODE == AX12_STATUS_RETURN_ALWAYS
		if(!AX12_instruction_wait(id_servo) || AX12_instruction_get_last_status(id_servo).error == AX12_ERROR_OK)
			return FALSE;
	#endif

	return TRUE;
}

bool_e AX12_set_position(Uint8 id_servo, Uint16 angle) {
	if(angle > AX12_MAX_ANGLE) angle = AX12_MAX_ANGLE-1;
	return AX12_instruction_write16(id_servo, AX12_GOAL_POSITION_L, angle);
}

bool_e AX12_set_move_to_position_speed(Uint8 id_servo, Uint8 percentage) {
	if(AX12_on_the_robot[id_servo].is_wheel_enabled) {
		debug_printf("AX12: AX12_set_move_to_position_speed while in wheel mode, use AX12_set_speed_percentage instead.\n");
		return FALSE;
	}

	if(percentage > AX12_MAX_PERCENTAGE) percentage = AX12_MAX_PERCENTAGE;
	Uint16 realValue = AX12_PERCENTAGE_TO_1024(percentage);

	return AX12_instruction_write16(id_servo, AX12_GOAL_SPEED_L, realValue);
}

bool_e AX12_set_speed_percentage(Uint8 id_servo, Sint8 percentage) {
	bool_e isBackward;

	if(!AX12_on_the_robot[id_servo].is_wheel_enabled) {
		debug_printf("AX12: AX12_set_speed_percentage while not in wheel mode, use AX12_set_move_to_position_speed instead.\n");
		return FALSE;
	}

	isBackward = percentage < 0;
	//percentage & 0x7F: on enlève le bit de signe, isBackward << 10: ajoute 1024 si on tourne a l'envers
	percentage = percentage & 0x7F;
	if(percentage > AX12_MAX_PERCENTAGE) percentage = AX12_MAX_PERCENTAGE;
	Uint16 realValue = AX12_PERCENTAGE_TO_1024(percentage) | (((Uint16)isBackward) << 10);

	return AX12_instruction_write16(id_servo, AX12_GOAL_SPEED_L, realValue);
}

bool_e AX12_set_torque_limit(Uint8 id_servo, Uint8 percentage) {
	if(percentage > AX12_MAX_PERCENTAGE) percentage = AX12_MAX_PERCENTAGE;

	return AX12_instruction_write16(id_servo, AX12_TORQUE_LIMIT_L, AX12_PERCENTAGE_TO_1024(percentage));
}

bool_e AX12_set_punch_torque_percentage(Uint8 id_servo, Uint8 percentage) {
	if(percentage > AX12_MAX_PERCENTAGE) percentage = AX12_MAX_PERCENTAGE;
	return AX12_instruction_write16(id_servo, AX12_PUNCH_L, AX12_PERCENTAGE_TO_1024(percentage));
}

#endif /* def USE_AX12_SERVO */
